using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace litclassic
{
    class BookSerializer
    {
        // хочется, чтобы каждая книга была отдельным файлом
        // также хочется, чтобы выбор книги был "внутренним", не как выбор файла, а как скорее выбор элемента в ListBox'e
        // но не обходим ли такой выбор?
        // как организовать наиболее оптимальное хранение книг, а затем и их использование?
        // подгружать сразу все книги? 
        //
        // необходим файл списка книг, по которому затем будут они загружаться, а также в который будут вноситься новые
        //
        // загрузить здесь и список книг и сами книги, в общем проделать всю работу так, 
        // чтобы в основном коде достаточно было создать объект этого класса, а затем, возможно, вызвать лишь один его метод.
        //
        // точно нужно сделать свои короткие и простые методы для сериализации любыъ объектов
        //
        // возможно, лучше сериализовывать по-отдельности все данные из book.cs 

        public void listBooksWriter(ListBooks listBooks)
        {

        }
        public void listBooksReader()
        {

        }
    }
}
